SOLU/integrationTest-Particle/tests/Cases/nHeptaneDroplet/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default             none;
    div(WENO)           Gauss WENOUpwindFit 3 0;
    div(Linear)         Gauss linear;
    div(LimitedLinear)  Gauss limitedLinear 1;
}

laplacianSchemes
{
    default         Gauss linear uncorrected;
}

interpolationSchemes
{
    default             none;
    flux(U)             linear;
    interpolate(psiWENO)   WENOUpwindFit 3 0;
    interpolate(psiLinear) linear;
}

snGradSchemes
{
    default         uncorrected;
}


wallDist
{
    method meshWave;
}
// ************************************************************************* //
